# Pandas로 데이터 읽어오기

In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv('../data/01. CCTV_in_Seoul.csv',  encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]

'기관명'

In [5]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [6]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [7]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls', 
                          header = 2,
                          usecols = 'B, D, G, J, N')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [8]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별', 
                          pop_Seoul.columns[1] : '인구수', 
                          pop_Seoul.columns[2] : '한국인', 
                          pop_Seoul.columns[3] : '외국인', 
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

# Pandas 기초 (1)

In [9]:
import numpy as np

In [10]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [11]:
dates = pd.date_range('20210808', periods=6)
dates

DatetimeIndex(['2021-08-08', '2021-08-09', '2021-08-10', '2021-08-11',
               '2021-08-12', '2021-08-13'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randint(10000, size=(6,4)), index=dates, columns=(['A','B','C','D']))
df

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338
2021-08-11  7199  4730  5247  3082
2021-08-12  1615  9036  8468  7365
2021-08-13  9233  5232  6627  6840

In [13]:
df.head(3) #head는 앞에 몇개를 보여주라는 명령, default = 5

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338

In [14]:
df.index

DatetimeIndex(['2021-08-08', '2021-08-09', '2021-08-10', '2021-08-11',
               '2021-08-12', '2021-08-13'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[5720, 1811, 2407, 7697],
       [3886, 3832, 4737, 5734],
       [6128, 5441,  286, 6338],
       [7199, 4730, 5247, 3082],
       [1615, 9036, 8468, 7365],
       [9233, 5232, 6627, 6840]])

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-08-08 to 2021-08-13
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int64
 1   B       6 non-null      int64
 2   C       6 non-null      int64
 3   D       6 non-null      int64
dtypes: int64(4)
memory usage: 240.0 bytes

In [18]:
df.describe() # 통계적 요소 확인

                 A            B            C            D
count     6.000000     6.000000     6.000000     6.000000
mean   5630.166667  5013.666667  4628.666667  6176.000000
std    2640.501272  2372.480783  2929.929874  1671.077616
min    1615.000000  1811.000000   286.000000  3082.000000
25%    4344.500000  4056.500000  2989.500000  5885.000000
50%    5924.000000  4981.000000  4992.000000  6589.000000
75%    6931.250000  5388.750000  6282.000000  7233.750000
max    9233.000000  9036.000000  8468.000000  7697.000000

In [19]:
df.sort_values(by='B',ascending=False)

               A     B     C     D
2021-08-12  1615  9036  8468  7365
2021-08-10  6128  5441   286  6338
2021-08-13  9233  5232  6627  6840
2021-08-11  7199  4730  5247  3082
2021-08-09  3886  3832  4737  5734
2021-08-08  5720  1811  2407  7697

In [20]:
df

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338
2021-08-11  7199  4730  5247  3082
2021-08-12  1615  9036  8468  7365
2021-08-13  9233  5232  6627  6840

In [21]:
df[:3]

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338

In [22]:
df['20210814':'20210818'] # 범위에 없어도 없다고 나오지 에러 아님 (값이 없을 뿐)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [23]:
df.loc[dates[0]] #특정 행의 값만 보는 것도 가능

A    5720
B    1811
C    2407
D    7697
Name: 2021-08-08 00:00:00, dtype: int64

In [24]:
df.loc[:,['A','C']]

               A     C
2021-08-08  5720  2407
2021-08-09  3886  4737
2021-08-10  6128   286
2021-08-11  7199  5247
2021-08-12  1615  8468
2021-08-13  9233  6627

In [25]:
df.loc[['20210808', '20210810'],['A','C']]

               A     C
2021-08-08  5720  2407
2021-08-10  6128   286

In [26]:
df.loc[dates[0],'A']

5720

In [27]:
df.iloc[3] # loc와 다른 점은 index를 활용

A    7199
B    4730
C    5247
D    3082
Name: 2021-08-11 00:00:00, dtype: int64

In [28]:
df.iloc[[1,2,4],[0,2]]

               A     C
2021-08-09  3886  4737
2021-08-10  6128   286
2021-08-12  1615  8468

In [29]:
df.iloc[1:3,:]

               A     B     C     D
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338

In [30]:
df

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338
2021-08-11  7199  4730  5247  3082
2021-08-12  1615  9036  8468  7365
2021-08-13  9233  5232  6627  6840

In [31]:
df[df.A > 5000] # 특정 컬럼에서만

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-10  6128  5441   286  6338
2021-08-11  7199  4730  5247  3082
2021-08-13  9233  5232  6627  6840

In [32]:
df[df > 5000] # 전체에 대해서는 만족하지 않는 것은 NaN(Not a Number) 처리

                 A       B       C       D
2021-08-08  5720.0     NaN     NaN  7697.0
2021-08-09     NaN     NaN     NaN  5734.0
2021-08-10  6128.0  5441.0     NaN  6338.0
2021-08-11  7199.0     NaN  5247.0     NaN
2021-08-12     NaN  9036.0  8468.0  7365.0
2021-08-13  9233.0  5232.0  6627.0  6840.0

In [33]:
df2 = df.copy() # 복사할 때, 이렇게! df2=df 라고 하면, 원본은 하나(위치만 복사 됨)

In [34]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

               A     B     C     D      E
2021-08-08  5720  1811  2407  7697    one
2021-08-09  3886  3832  4737  5734    one
2021-08-10  6128  5441   286  6338    two
2021-08-11  7199  4730  5247  3082  three
2021-08-12  1615  9036  8468  7365   four
2021-08-13  9233  5232  6627  6840  three

In [35]:

df2['E'].isin(['two','four'])

2021-08-08    False
2021-08-09    False
2021-08-10     True
2021-08-11    False
2021-08-12     True
2021-08-13    False
Freq: D, Name: E, dtype: bool

In [36]:

df2[df2['E'].isin(['two','four'])] # isin을 이용하면 T/F가 반환되므로 조건에 맞는 데어터 선택가능

               A     B     C     D     E
2021-08-10  6128  5441   286  6338   two
2021-08-12  1615  9036  8468  7365  four

In [37]:
df

               A     B     C     D
2021-08-08  5720  1811  2407  7697
2021-08-09  3886  3832  4737  5734
2021-08-10  6128  5441   286  6338
2021-08-11  7199  4730  5247  3082
2021-08-12  1615  9036  8468  7365
2021-08-13  9233  5232  6627  6840

In [38]:
df.apply(np.cumsum) # 누적합 구하기

                A      B      C      D
2021-08-08   5720   1811   2407   7697
2021-08-09   9606   5643   7144  13431
2021-08-10  15734  11084   7430  19769
2021-08-11  22933  15814  12677  22851
2021-08-12  24548  24850  21145  30216
2021-08-13  33781  30082  27772  37056

In [39]:
df.apply(lambda x: x.max() - x.min()) # 람다 함수도 이용가능!

A    7618
B    7225
C    8182
D    4615
dtype: int64

# Pandas 이용한 CCTV와 인구 현황 파악

In [40]:
CCTV_Seoul.sort_values(by='소계').head() # 오름차순 정리

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [41]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head() # 내림차순 정리

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [42]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] + CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전']  * 100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [43]:
pop_Seoul.head() # 0번 행의 합계는 필요없음

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [44]:
pop_Seoul.drop([0], inplace=True) # 0번 행 삭제
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [45]:
pop_Seoul['구별'].unique() #nan이 보임

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [46]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [47]:
pop_Seoul.drop([26], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [48]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100 # 외국인 비율 계산
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100 # 고령자 비율 계산
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [49]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

# Pandas 기초 (2)

## 연습용 데이터

In [50]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [51]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

## DataFrame 병합하기

In [52]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [53]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [54]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [55]:
result = pd.concat([df1,df2,df3]) # 단순히 열 방향으로 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [56]:
result.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [57]:
result = pd.concat([df1,df2,df3], keys=['x','y','z']) # key옵션을 사용하면 다중 index가 되어 level을 형성
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [58]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [59]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [60]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [61]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

result = pd.concat([df1, df4], axis=1)
print(df4) # 마지막만 실행되니까 print로 실행
result

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [62]:
result = pd.concat([df1, df4], axis=1, join='inner') # join옵션을 inner로 하면 겹치는 부분만
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [63]:
result1 = pd.concat([df1, df4])
result2 = pd.concat([df1, df4], ignore_index=True) # 합치고 index를 재부여
print(result1)
result2

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [64]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [65]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [66]:
pd.merge(left, right, on='key') # 공통된 key에 대해서만 병합

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [67]:
pd.merge(left, right, how='left', on='key') # how옵션으로 기준을 설정

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [68]:
pd.merge(left, right, how='outer', on='key') # how옵션에 'outer'과 'cross'도 있음/ default = 'inner'

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [70]:
pd.merge(left, right, how='cross')

   key_x   A   B key_y   C   D
0     K0  A0  B0    K0  C0  D0
1     K0  A0  B0    K1  C1  D1
2     K0  A0  B0    K2  C2  D2
3     K0  A0  B0    K3  C3  D3
4     K4  A1  B1    K0  C0  D0
5     K4  A1  B1    K1  C1  D1
6     K4  A1  B1    K2  C2  D2
7     K4  A1  B1    K3  C3  D3
8     K2  A2  B2    K0  C0  D0
9     K2  A2  B2    K1  C1  D1
10    K2  A2  B2    K2  C2  D2
11    K2  A2  B2    K3  C3  D3
12    K3  A3  B3    K0  C0  D0
13    K3  A3  B3    K1  C1  D1
14    K3  A3  B3    K2  C2  D2
15    K3  A3  B3    K3  C3  D3